In [2]:
import pandas as pd

In [3]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'Country': ['USA', 'Canada', 'Uk']
}

df = pd.DataFrame(data)

In [4]:
print(df)

      Name  Age Country
0    Alice   25     USA
1      Bob   30  Canada
2  Charlie   35      Uk

In [6]:
df.head()

      Name  Age Country
0    Alice   25     USA
1      Bob   30  Canada
2  Charlie   35      Uk

In [7]:
df.tail()

      Name  Age Country
0    Alice   25     USA
1      Bob   30  Canada
2  Charlie   35      Uk

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     3 non-null      object
 1   Age      3 non-null      int64
 2   Country  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

In [9]:
df.describe()

        Age
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [10]:
df.columns

Index(['Name', 'Age', 'Country'], dtype='object')

In [11]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [12]:
df['Age']

0    25
1    30
2    35
Name: Age, dtype: int64

In [14]:
df[['Age', 'Name']]

   Age     Name
0   25    Alice
1   30      Bob
2   35  Charlie

In [15]:
df.loc[0]

Name       Alice
Age           25
Country      USA
Name: 0, dtype: object

In [16]:
df.iloc[0]

Name       Alice
Age           25
Country      USA
Name: 0, dtype: object

In [17]:
df[df['Age'] > 30]

      Name  Age Country
2  Charlie   35      Uk

In [18]:
df[(df['Age'] > 25) & (df['Country'] == 'UK')]

Empty DataFrame
Columns: [Name, Age, Country]
Index: []

In [20]:
df[df['Name'].str.startswith('A')]

    Name  Age Country
0  Alice   25     USA

In [21]:
df[df['Country'].isin(['USA', 'UK'])]
df[~df['Country'].isin(['Canada'])]

      Name  Age Country
0    Alice   25     USA
2  Charlie   35      Uk

In [22]:
new_row = pd.DataFrame([{'Name': 'Diana', 'Age': 28, 'Country': 'Germany'}])
df = pd.concat([df, new_row], ignore_index=True)

In [23]:
df

      Name  Age  Country
0    Alice   25      USA
1      Bob   30   Canada
2  Charlie   35       Uk
3    Diana   28  Germany

In [24]:
df.loc[df['Name'] == 'Alice']
df.iloc[2]

Name       Charlie
Age             35
Country         Uk
Name: 2, dtype: object

In [25]:
df.loc[df['Name'] == 'Bob', 'Age'] = 31
df['Country'] = df['Country'].str.upper()

In [26]:
df

      Name  Age  Country
0    Alice   25      USA
1      Bob   31   CANADA
2  Charlie   35       UK
3    Diana   28  GERMANY

In [27]:
df.isnull().sum()

Name       0
Age        0
Country    0
dtype: int64

In [28]:
df.dropna(inplace=True)

In [29]:
df.fillna({'Age': 0}, inplace=True)

In [30]:
df.rename(columns={'Age': 'Years'}, inplace=True)

In [31]:
df

      Name  Years  Country
0    Alice     25      USA
1      Bob     31   CANADA
2  Charlie     35       UK
3    Diana     28  GERMANY

In [32]:
df['Years'] = df['Years'].astype(float)

In [33]:
df.dtypes

Name        object
Years      float64
Country     object
dtype: object

In [34]:
df['Country'].value_counts()

Country
USA        1
CANADA     1
UK         1
GERMANY    1
Name: count, dtype: int64

In [36]:
df.to_csv('cleaned_data.csv', index=False)